benchmark_report/wrk_results_5267/wrk_100concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.21ms  200.38ms   1.65s    96.04%
    Req/Sec     0.97k    78.22     1.20k    84.58%
  Latency Distribution
     50%    8.27ms
     75%    9.19ms
     90%   10.21ms
     99%    1.30s 
  348936 requests in 31.67s, 31.95MB read
Requests/sec:  11017.46
Transfer/sec:      1.01MB