benchmark_report/wrk_results_5267/wrk_200concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   137.19ms  298.80ms   1.93s    86.80%
    Req/Sec     0.94k   199.79     1.74k    72.31%
  Latency Distribution
     50%   11.99ms
     75%   14.61ms
     90%  603.83ms
     99%    1.32s 
  338843 requests in 31.97s, 31.02MB read
  Socket errors: connect 0, read 0, write 0, timeout 160
Requests/sec:  10599.20
Transfer/sec:      0.97MB