benchmark_report/wrk_results_5267/wrk_400concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   184.86ms  319.64ms   1.91s    83.06%
    Req/Sec     0.94k   258.22     2.21k    69.70%
  Latency Distribution
     50%   12.49ms
     75%  220.08ms
     90%  759.44ms
     99%    1.18s 
  338178 requests in 32.73s, 30.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 1099
Requests/sec:  10332.55
Transfer/sec:      0.95MB