benchmark_report/wrk_results_5267/wrk_600concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 600 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   202.92ms  340.43ms   1.91s    82.89%
    Req/Sec     0.96k   306.01     3.49k    72.29%
  Latency Distribution
     50%   12.41ms
     75%  290.63ms
     90%  804.14ms
     99%    1.25s 
  345238 requests in 31.89s, 31.61MB read
  Socket errors: connect 0, read 0, write 0, timeout 1894
Requests/sec:  10824.93
Transfer/sec:      0.99MB