benchmark_report/wrk_results_5267/wrk_800concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   185.51ms  336.88ms   1.91s    83.94%
    Req/Sec     0.93k   292.97     2.75k    72.59%
  Latency Distribution
     50%   12.63ms
     75%  184.33ms
     90%  786.08ms
     99%    1.28s 
  333744 requests in 31.82s, 30.56MB read
  Socket errors: connect 0, read 0, write 0, timeout 3083
Requests/sec:  10488.69
Transfer/sec:      0.96MB